import React, { useState } from 'react'
import "./ant.css"
import Header from "../header/Header"
import Footer from '../header/Footer'
import { Button } from 'react-bootstrap'

export default function Kali() {
  const [x, setX] = useState(false);

  function f() {
      setX(!x);
    }

  return (
    

    <div  style={{ backgroundColor: x ? 'white' : 'black' }}>
      <Header/>
    <div className={`Alphax ${x ? 'wbg' : ""}`}>
      <h3 className="heading"> శ్రీ కాళికాష్టకమ్ </h3>
        <Button  onClick={f} style={{float:"inline-end"}} variant="success"> {x? "black": "white" } background</  Button>
<p>          
   ధ్యానమ్ - <br/> 
గలద్రక్తముండావళీకంఠమాలా <br/>
మహాఘోరరావా సుదంష్ట్రా కరాళా | <br/>
వివస్త్రా శ్మశానాలయా ముక్తకేశీ <br/>
మహాకాలకామాకులా కాళికేయమ్ || 1 ||  <br/>

</p>

<p>
భుజేవామయుగ్మే శిరోఽసిం దధానా  <br/>
వరం దక్షయుగ్మేఽభయం వై తథైవ | <br/>
సుమధ్యాఽపి తుంగస్తనా భారనమ్రా <br/>
లసద్రక్తసృక్కద్వయా సుస్మితాస్యా || 2 || <br/>
</p> 


<p>
శవద్వంద్వకర్ణావతంసా సుకేశీ  <br/>
లసత్ప్రేతపాణిం ప్రయుక్తైకకాంచీ | <br/>
శవాకారమంచాధిరూఢా శివాభి- <br/>
-శ్చతుర్దిక్షుశబ్దాయమానాఽభిరేజే || 3 || <br/>
</p>

<p>
స్తుతిః - <br/>
విరంచ్యాదిదేవాస్త్రయస్తే గుణాస్త్రీన్ <br/>
సమారాధ్య కాళీం ప్రధానా బభూవుః | <br/>
అనాదిం సురాదిం మఖాదిం భవాదిం <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 1 || <br/>
</p>

<p>
జగన్మోహినీయం తు వాగ్వాదినీయం  <br/>
సుహృత్పోషిణీ శత్రుసంహారణీయమ్ | <br/>
వచస్తంభనీయం కిముచ్చాటనీయం <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 2 || <br/>
</p>

<p>
ఇయం స్వర్గదాత్రీ పునః కల్పవల్లీ  <br/>
మనోజాస్తు కామాన్ యథార్థం ప్రకుర్యాత్ |  <br/>
తథా తే కృతార్థా భవంతీతి నిత్యం  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 3 ||  <br/>
</p>

<p>
సురాపానమత్తా సుభక్తానురక్తా  <br/>
లసత్పూతచిత్తే సదావిర్భవత్తే |  <br/>
జపధ్యానపూజాసుధాధౌతపంకా  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 4 ||  <br/>
</p>

<p>
చిదానందకందం హసన్మందమందం  <br/>
శరచ్చంద్రకోటిప్రభాపుంజబింబమ్ |  <br/>
మునీనాం కవీనాం హృది ద్యోతయంతం  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 5 ||  <br/>
</p>

<p>
మహామేఘకాళీ సురక్తాపి శుభ్రా  <br/>
కదాచిద్విచిత్రాకృతిర్యోగమాయా |  <br/>
న బాలా న వృద్ధా న కామాతురాపి  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 6 ||  <br/>
</p>

<p>
క్షమస్వాపరాధం మహాగుప్తభావం  <br/>
మయా లోకమధ్యే ప్రకాశీకృతం యత్ |  <br/>
తవ ధ్యానపూతేన చాపల్యభావాత్  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 7 ||  <br/>
</p>

<p>
యది ధ్యానయుక్తం పఠేద్యో మనుష్య-  <br/>
-స్తదా సర్వలోకే విశాలో భవేచ్చ |  <br/>
గృహే చాష్టసిద్ధిర్మృతే చాపి ముక్తిః  <br/>
స్వరూపం త్వదీయం న విందంతి దేవాః || 8 ||  <br/>
</p>

<p>
ఇతి శ్రీమచ్ఛంకరాచార్య విరచితం శ్రీ కాళికాష్టకమ్ ||
</p>
    </div>
    <Footer/>
    </div>
  )
}
